Repository: Nate-br/vision
Catalog: lib/l10n/app_*.arb
Languages: am, or

# appName
source: Vision for a Better Life
am: የተሻለ ሕይወት ራዕይ
or: Mul'ata Jireenya Fooyya'aa

# companyName
source: Vision for a Better Life SLA
am: የተሻለ ሕይወት ራዕይ ኃ/የተ/የግ/ማ
or: Mul'ata Jireenya Fooyya'aa SLA

# tagline
source: Your Vision, Our Support
am: የእርስዎ ራዕይ፣ የእኛ ድጋፍ
or: Mul'ata Keessan, Deeggarsa Keenya

# motto
source: Building Better Futures Together
am: የተሻሉ የወደፊት ሕይወቶችን እንገነባለን
or: Gara Fuulduraatti Waliin Ijaarra

source: Apply for Loan
am: ለብድር ያመልክቱ
or: Liqii Af-gaafachuu

source: Calculator
am: ማስያ
or: Herregaa

source: Our Services
am: የእኛ አገልግሎቶች
or: Tajaajiloota Keenya

source: Personal Loans
am: የግል ብድሮች
or: Liqii Dhuunfaa

source: Business Loans
am: የንግድ ብድሮች
or: Liqii Daldalaa

source: Emergency Loans
am: የአስቸኳይ ጊዜ ብድሮች
or: Liqii Yeroo Hatattamaa

source: Happy Customers
am: ደስተኛ ደንበኞች
or: Maamiltoota Gammadan

source: Quick Approval
am: ፈጣን ማጽደቅ
or: Mirkaneeffannoo Saffisaa

source: Rating
am: ደረጃ
or: Madaallii

source: About Us
am: ስለ እኛ
or: Waa'ee Keenya

source: Contact
am: እውቂያ
or: Wal-qunnamtii

source: FAQs
am: ተደጋጋሚ ጥያቄዎች
or: Gaaffiiwwan Yeroo Baay'ee Gaafataman

source: Language
am: ቋንቋ
or: Afaan

# selectLanguage
source: Select your preferred language
am: የሚመርጡትን ቋንቋ ይምረጡ
or: Afaan filatamaa keessan filadhaa
